#조건문(if문)
# 돈이 있으면 택시를 타고, 돈이 없으면 걸어간다
# 와 같이 어떤 조건에 따라 행위의 변동을 줘야할 때 사용한다.

money = True # True : 돈이 있다. / False : 돈이 없다.

if money : 
    print("택시를 탄다.")
else:
    print("걸어 간다.")
    
# 이를 조건문이라고 부른다.

# 조건문의 구조는 그냥 비슷함

# * 다른점
# 들여쓰기가 강제됨, 들여쓰기 레벨도 맞춰져야함, : 은 꼭 있어야만 한다.

# 비교연산자 - 똑같음

# and , or, not
# x or y - 둘중 하나 (|의 기능과 동일)
# x and y - 둘 다 (&의 기능과 동일)
# not x - x가 거짓이면 참이됨(!의 기능과 동일)


# in, not in -리스트, 튜플, 문자열에서 해당
# x in 리스트 - x not in 리스트
# x in 튜플 -  x not in 튜플
# x in 문자열 - x not in 문자열

