#프로그램의 입출력

# 명령 프롬프트(CMD)에서 type 파일위치/파일명 를 작성하면 해당 파일의 내용을 출력해준다.
# type은 바로 뒤에 적인 파일 이름을 인수로 받아 파일의 내용을 출력해주는 명령어이다.
# 대부분의 명령 프롬프트에서 사용되는 명령어는 아래와 같이 인수를 전달하여 프로그램을 실행하는 방식을 따른다.

# 명령어 [인수1, 인수2, ...]

# 이런 기능을 파이썬에서도 사용할 수 있다.

####
# sys모듈 사용하기
# 파이썬에서는 sys 모듈을 사용하여 프로그램에 인수를 전달할 수 있다. 
# sys 모듈을 사용하려면 다음 예의 import sys처럼 import 명령어를 사용해야 한다.

# import sys

# args = sys.argv[1:]
# for i in args :
#     print(i)
    
#이렇게 저장해두면 CMD에서 해당 파일을 호출 했을때 type을 사용했던것 처럼 인수를 줄때마다 argv에 하나씩 담는다 
# 해당 파일의 호출은 python sys1.py 인수1 인수2 ... 와 같은 방식으로 사용하고 sys1.py가 argv[0]에 담기고 인수1, 인수2 가 각각 argv[1], argv[2]에 담기게 되고 
# 인수1, 인수2 가 출력되게 될것이다.

#현재 파일을 저장하고 cmd에서 파일 위치로 가서 python sys1.py(지금 이 파일의 명) 인수1 인수2 ..를 입력해보자.

# 위 사용법을 응용해서 간단한 프로그램을 만들어보자

import sys

args = sys.argv[1:]

for i in args :
    print(i.upper(), end=" ")

# 입력한 인수를 대문자로 모두 바꾸며 한줄로 출력해주는 애플리케이션이다.
# 해당파일을 생성하고 다시 실행시켜보자.

# 보니까 sys모듈의 기능이 매우 많다.
# 전체적으로는 CLI에서 사용되는 것으로 보임...
# https://ctkim.tistory.com/entry/python-sys-%EB%AA%A8%EB%93%88